HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_regdef.h
/** \brief Host Control 2 Register */
typedef struct _Ifx_SDMMC_HOST_CTRL2_Bits
{
    Ifx_UReg_16Bit UHS_MODE_SEL:3;    /**< \brief [2:0] eMMC Speed Mode Select - MODE_SEL (rw) */
    Ifx_UReg_16Bit SIGNALING_EN:1;    /**< \brief [3:3] 1.8 V Signaling Enable - SIGNALING_EN (rw) */
    Ifx_UReg_16Bit DRV_STRENGTH_SEL:2;    /**< \brief [5:4] Driver Strength Select - DRV_STRENGTH_SEL (rw) */
    Ifx_UReg_16Bit EXEC_TUNING:1;     /**< \brief [6:6] Execute Tuning - EXEC_TUNING (rw) */
    Ifx_UReg_16Bit SAMPLE_CLK_SEL:1;    /**< \brief [7:7] Sampling Clock Select - SAMPLE_CLK_SEL (rw) */
    Ifx_UReg_16Bit UHS2_IF_ENABLE:1;    /**< \brief [8:8] UHS-II Interface Enable - UHS2_IF_ENABLE (rw) */
    Ifx_UReg_16Bit reserved_9:1;      /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_16Bit ADMA2_LEN_MODE:1;    /**< \brief [10:10] ADMA2 Length Mode - ADMA2_LEN_MODE (rw) */
    Ifx_UReg_16Bit CMD23_ENABLE:1;    /**< \brief [11:11] CMD23 Enable - CMD23_ENABLE (rw) */
    Ifx_UReg_16Bit HOST_VER4_ENABLE:1;    /**< \brief [12:12] Host Version 4 Enable - HOST_VER4_ENABLE (rw) */
    Ifx_UReg_16Bit ADDRESSING:1;      /**< \brief [13:13] 64-bit Addressing - ADDRESSING (rw) */
    Ifx_UReg_16Bit ASYNC_INT_ENABLE:1;    /**< \brief [14:14] Asynchronous Interrupt Enable - ASYNC_INT_ENABLE (rw) */
    Ifx_UReg_16Bit PRESET_VAL_ENABLE:1;    /**< \brief [15:15] Preset Value Enable - PRESET_VAL_ENABLE (rw) */
} Ifx_SDMMC_HOST_CTRL2_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_SDMMC_ID_Bits
{
    Ifx_UReg_32Bit MODREV:8;          /**< \brief [7:0] Module Revision Number - MODREV (r) */
    Ifx_UReg_32Bit MODTYPE:8;         /**< \brief [15:8] Module Type - MODTYPE (r) */
    Ifx_UReg_32Bit MODNUM:16;         /**< \brief [31:16] Module Number Value - MODNUM (r) */
} Ifx_SDMMC_ID_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_SDMMC_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_SDMMC_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_SDMMC_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_SDMMC_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_SDMMC_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_SDMMC_KRSTCLR_Bits;

/** \brief DMA burst control register */
typedef struct _Ifx_SDMMC_MBIU_CTRL_Bits
{
    Ifx_UReg_32Bit UNDEFL_INCR_EN:1;    /**< \brief [0:0] Controls the generation of undefined length INCR transfer on master interface (rw) */
    Ifx_UReg_32Bit BURST_INCR4_EN:1;    /**< \brief [1:1] Controls generation of INCR4 transfers on master interface (rw) */
    Ifx_UReg_32Bit BURST_INCR8_EN:1;    /**< \brief [2:2] Controls generation of INCR8 transfers on master interface (rw) */
    Ifx_UReg_32Bit BURST_INCR16_EN:1;    /**< \brief [3:3] Controls generation of INCR16 transfers on master interface (rw) */
    Ifx_UReg_32Bit reserved_4:12;     /**< \brief [15:4] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:2;     /**< \brief [17:16] \internal Reserved */
    Ifx_UReg_32Bit reserved_18:6;     /**< \brief [23:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_24:2;     /**< \brief [25:24] \internal Reserved */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_SDMMC_MBIU_CTRL_Bits;

/** \brief MSHC version */
typedef struct _Ifx_SDMMC_MSHC_VER_ID_Bits
{
    Ifx_UReg_32Bit MSHC_VER_ID:32;    /**< \brief [31:0] Current release number - MSHC_VER_ID (r) */
} Ifx_SDMMC_MSHC_VER_ID_Bits;

/** \brief MSHC version type */
typedef struct _Ifx_SDMMC_MSHC_VER_TYPE_Bits
{
    Ifx_UReg_32Bit MSHC_VER_TYPE:32;    /**< \brief [31:0] Current release type - MSHC_VER_TYPE (r) */
} Ifx_SDMMC_MSHC_VER_TYPE_Bits;

/** \brief Normal Interrupt Signal Enable Register */
typedef struct _Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits
{
    Ifx_UReg_16Bit CMD_COMPLETE_SIGNAL_EN:1;    /**< \brief [0:0] Command Complete Signal Enable - CMD_COMPLETE_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit XFER_COMPLETE_SIGNAL_EN:1;    /**< \brief [1:1] Transfer Complete Signal Enable - XFER_COMPLETE_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit BGAP_EVENT_SIGNAL_EN:1;    /**< \brief [2:2] Block Gap Event Signal Enable - BGAP_EVENT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit DMA_INTERRUPT_SIGNAL_EN:1;    /**< \brief [3:3] DMA Interrupt Signal Enable - DMA_INTERRUPT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit BUF_WR_READY_SIGNAL_EN:1;    /**< \brief [4:4] Buffer Write Ready Signal Enable - BUF_WR_READY_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit BUF_RD_READY_SIGNAL_EN:1;    /**< \brief [5:5] Buffer Read Ready Signal Enable - BUF_RD_READY_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CARD_INSERTION_SIGNAL_EN:1;    /**< \brief [6:6] Card Insertion Signal Enable - CARD_INSERTION_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CARD_REMOVAL_SIGNAL_EN:1;    /**< \brief [7:7] Card Removal Signal Enable - CARD_REMOVAL_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CARD_INTERRUPT_SIGNAL_EN:1;    /**< \brief [8:8] Card Interrupt Signal Enable - CARD_INTERRUPT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit INT_A_SIGNAL_EN:1;    /**< \brief [9:9] INT_A (Embedded) Signal Enable - INT_A_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit INT_B_SIGNAL_EN:1;    /**< \brief [10:10] INT_B (Embedded) Signal Enable - INT_B_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit INT_C_SIGNAL_EN:1;    /**< \brief [11:11] INT_C (Embedded) Signal Enable - INT_C_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit RE_TUNE_EVENT_SIGNAL_EN:1;    /**< \brief [12:12] Re-Tuning Event Signal Enable. - RE_TUNE_EVENT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit FX_EVENT_SIGNAL_EN:1;    /**< \brief [13:13] FX Event Signal Enable - FX_EVENT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CQE_EVENT_SIGNAL_EN:1;    /**< \brief [14:14] Command Queuing Engine Event Signal Enable - CQE_EVENT_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits;

/** \brief Normal Interrupt Status Register */
typedef struct _Ifx_SDMMC_NORMAL_INT_STAT_Bits
{
    Ifx_UReg_16Bit CMD_COMPLETE:1;    /**< \brief [0:0] Command Complete - CMD_COMPLETE (rwh) */
    Ifx_UReg_16Bit XFER_COMPLETE:1;    /**< \brief [1:1] Transfer Complete - XFER_COMPLETE (rwh) */
    Ifx_UReg_16Bit BGAP_EVENT:1;      /**< \brief [2:2] Block Gap Event - BGAP_EVENT (rwh) */
    Ifx_UReg_16Bit DMA_INTERRUPT:1;    /**< \brief [3:3] DMA Interrupt - DMA_INTERRUPT (rwh) */
    Ifx_UReg_16Bit BUF_WR_READY:1;    /**< \brief [4:4] Buffer Write Ready - BUF_WR_READY (rwh) */
    Ifx_UReg_16Bit BUF_RD_READY:1;    /**< \brief [5:5] Buffer Read Ready - BUF_RD_READY (rwh) */
    Ifx_UReg_16Bit CARD_INSERTION:1;    /**< \brief [6:6] Card Insertion - CARD_INSERTION (rwh) */
    Ifx_UReg_16Bit CARD_REMOVAL:1;    /**< \brief [7:7] Card Removal - CARD_REMOVAL (rwh) */
    Ifx_UReg_16Bit CARD_INTERRUPT:1;    /**< \brief [8:8] Card Interrupt - CARD_INTERRUPT (r) */
    Ifx_UReg_16Bit INT_A:1;           /**< \brief [9:9] INT_A (Embedded) - INT_A (r) */
    Ifx_UReg_16Bit INT_B:1;           /**< \brief [10:10] INT_B (Embedded) - INT_B (r) */
    Ifx_UReg_16Bit INT_C:1;           /**< \brief [11:11] INT_C (Embedded) - INT_C (r) */
    Ifx_UReg_16Bit RE_TUNE_EVENT:1;    /**< \brief [12:12] Re-tuning Event - RE_TUNE_EVENT (r) */
    Ifx_UReg_16Bit FX_EVENT:1;        /**< \brief [13:13] FX Event - FX_EVENT (r) */
    Ifx_UReg_16Bit CQE_EVENT:1;       /**< \brief [14:14] Command Queuing Event - CQE_EVENT (rwh) */
    Ifx_UReg_16Bit ERR_INTERRUPT:1;    /**< \brief [15:15] Error Interrupt - ERR_INTERRUPT (r) */
} Ifx_SDMMC_NORMAL_INT_STAT_Bits;

/** \brief Normal Interrupt Status Enable Register */
typedef struct _Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits
{
    Ifx_UReg_16Bit CMD_COMPLETE_STAT_EN:1;    /**< \brief [0:0] Command Complete Status Enable - CMD_COMPLETE_STAT_EN (rw) */
    Ifx_UReg_16Bit XFER_COMPLETE_STAT_EN:1;    /**< \brief [1:1] Transfer Complete Status Enable - XFER_COMPLETE_STAT_EN (rw) */
    Ifx_UReg_16Bit BGAP_EVENT_STAT_EN:1;    /**< \brief [2:2] Block Gap Event Status Enable - BGAP_EVENT_STAT_EN (rw) */
    Ifx_UReg_16Bit DMA_INTERRUPT_STAT_EN:1;    /**< \brief [3:3] DMA Interrupt Status Enable - DMA_INTERRUPT_STAT_EN (rw) */
    Ifx_UReg_16Bit BUF_WR_READY_STAT_EN:1;    /**< \brief [4:4] Buffer Write Ready Status Enable - BUF_WR_READY_STAT_EN (rw) */
    Ifx_UReg_16Bit BUF_RD_READY_STAT_EN:1;    /**< \brief [5:5] Buffer Read Ready Status Enable - BUF_RD_READY_STAT_EN (rw) */
    Ifx_UReg_16Bit CARD_INSERTION_STAT_EN:1;    /**< \brief [6:6] Card Insertion Status Enable - CARD_INSERTION_STAT_EN (rw) */
    Ifx_UReg_16Bit CARD_REMOVAL_STAT_EN:1;    /**< \brief [7:7] Card Removal Status Enable - CARD_REMOVAL_STAT_EN (rw) */
    Ifx_UReg_16Bit CARD_INTERRUPT_STAT_EN:1;    /**< \brief [8:8] Card Interrupt Status Enable - CARD_INTERRUPT_STAT_EN (rw) */
    Ifx_UReg_16Bit INT_A_STAT_EN:1;    /**< \brief [9:9] INT_A (Embedded) Status Enable - INT_A_STAT_EN (rw) */
    Ifx_UReg_16Bit INT_B_STAT_EN:1;    /**< \brief [10:10] INT_B (Embedded) Status Enable. - INT_B_STAT_EN (rw) */
    Ifx_UReg_16Bit INT_C_STAT_EN:1;    /**< \brief [11:11] INT_C (Embedded) Status Enable. - INT_C_STAT_EN (rw) */
    Ifx_UReg_16Bit RE_TUNE_EVENT_STAT_EN:1;    /**< \brief [12:12] Re-Tuning Event Status Enable - RE_TUNE_EVENT_STAT_EN (rw) */
    Ifx_UReg_16Bit FX_EVENT_STAT_EN:1;    /**< \brief [13:13] FX Event Status Enable. - FX_EVENT_STAT_EN (rw) */
    Ifx_UReg_16Bit CQE_EVENT_STAT_EN:1;    /**< \brief [14:14] CQE Event Status Enable. - CQE_EVENT_STAT_EN (rw) */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits;

/** \brief Preset Value for Default Speed */
typedef struct _Ifx_SDMMC_PRESET_DS_Bits
{
    Ifx_UReg_16Bit FREQ_SEL_VAL:10;    /**< \brief [9:0] SDCLK/RCLK Frequency Select Value - FREQ_SEL_VAL (r) */
    Ifx_UReg_16Bit CLK_GEN_SEL_VAL:1;    /**< \brief [10:10] Clock Generator Select Value - CLK_GEN_SEL_VAL (r) */
    Ifx_UReg_16Bit reserved_11:3;     /**< \brief [13:11] \internal Reserved */
    Ifx_UReg_16Bit DRV_SEL_VAL:2;     /**< \brief [15:14] Driver Strength Select Value - DRV_SEL_VAL (r) */
} Ifx_SDMMC_PRESET_DS_Bits;

/** \brief Preset Value for High Speed */
typedef struct _Ifx_SDMMC_PRESET_HS_Bits
{
    Ifx_UReg_32Bit FREQ_SEL_VAL:10;    /**< \brief [9:0] SDCLK/RCLK Frequency Select Value - FREQ_SEL_VAL (r) */
    Ifx_UReg_32Bit CLK_GEN_SEL_VAL:1;    /**< \brief [10:10] Clock Generator Select Value - CLK_GEN_SEL_VAL (r) */
    Ifx_UReg_32Bit reserved_11:3;     /**< \brief [13:11] \internal Reserved */
    Ifx_UReg_32Bit DRV_SEL_VAL:2;     /**< \brief [15:14] Driver Strength Select Value - DRV_SEL_VAL (r) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_SDMMC_PRESET_HS_Bits;

/** \brief Preset Value for Initialization */
typedef struct _Ifx_SDMMC_PRESET_INIT_Bits
{
    Ifx_UReg_16Bit FREQ_SEL_VAL:10;    /**< \brief [9:0] SDCLK/RCLK Frequency Select Value - FREQ_SEL_VAL (r) */
    Ifx_UReg_16Bit CLK_GEN_SEL_VAL:1;    /**< \brief [10:10] Clock Generator Select Value - CLK_GEN_SEL_VAL (r) */
    Ifx_UReg_16Bit reserved_11:3;     /**< \brief [13:11] \internal Reserved */
    Ifx_UReg_16Bit DRV_SEL_VAL:2;     /**< \brief [15:14] Driver Strength Select Value - DRV_SEL_VAL (r) */
} Ifx_SDMMC_PRESET_INIT_Bits;

/** \brief Present State Register */
typedef struct _Ifx_SDMMC_PSTATE_REG_Bits
{
    Ifx_UReg_32Bit CMD_INHIBIT:1;     /**< \brief [0:0] Command Inhibit (CMD) - CMD_INHIBIT (r) */
    Ifx_UReg_32Bit CMD_INHIBIT_DAT:1;    /**< \brief [1:1] Command Inhibit (DAT)(SD/eMMC Mode only) - CMD_INHIBIT_DAT (r) */
    Ifx_UReg_32Bit DAT_LINE_ACTIVE:1;    /**< \brief [2:2] DAT Line Active (SD/eMMC Mode only) - DAT_LINE_ACTIVE (r) */
    Ifx_UReg_32Bit RE_TUNE_REQ:1;     /**< \brief [3:3] Re-Tuning Request - RE_TUNE_REQ (r) */
    Ifx_UReg_32Bit DAT_7_4:4;         /**< \brief [7:4] DAT[7:4] Line Signal Level (Embedded only) - DAT_7_4 (r) */
    Ifx_UReg_32Bit WR_XFER_ACTIVE:1;    /**< \brief [8:8] Write Transfer Active (SD/eMMC Mode only) - WR_XFER_ACTIVE (r) */
    Ifx_UReg_32Bit RD_XFER_ACTIVE:1;    /**< \brief [9:9] Read Transfer Active (SD/eMMC Mode only) - RD_XFER_ACTIVE (r) */
    Ifx_UReg_32Bit BUF_WR_ENABLE:1;    /**< \brief [10:10] Buffer Write Enable - BUF_WR_ENABLE (r) */
    Ifx_UReg_32Bit BUF_RD_ENABLE:1;    /**< \brief [11:11] Buffer Read Enable - BUF_RD_ENABLE (r) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit CARD_INSERTED:1;    /**< \brief [16:16] Card Inserted - CARD_INSERTED (r) */
    Ifx_UReg_32Bit CARD_STABLE:1;     /**< \brief [17:17] Card Stable - CARD_STABLE (r) */
    Ifx_UReg_32Bit CARD_DETECT_LEVEL:1;    /**< \brief [18:18] Card Detect Pin Level - CARD_DETECT_PIN_LEVEL (r) */
    Ifx_UReg_32Bit WR_PROTECT_SW_LVL:1;    /**< \brief [19:19] Write Protect Switch Pin Level - WR_PROTECT_SW_LVL (r) */
    Ifx_UReg_32Bit DAT_3_0:4;         /**< \brief [23:20] DAT[3:0] Line Signal Level (SD/eMMC Mode only) - DAT_3_0 (r) */
    Ifx_UReg_32Bit CMD_LINE_LVL:1;    /**< \brief [24:24] Command Line Signal Level (SD/eMMC Mode only) - CMD_LINE_LVL (r) */
    Ifx_UReg_32Bit HOST_REG_VOL:1;    /**< \brief [25:25] Host Regulator Voltage Stable - HOST_REG_VOL (r) */
    Ifx_UReg_32Bit reserved_26:1;     /**< \brief [26:26] \internal Reserved */
    Ifx_UReg_32Bit CMD_ISSUE_ERR:1;    /**< \brief [27:27] Command Not Issued by Error - CMD_ISSUE_ERR (r) */
    Ifx_UReg_32Bit SUB_CMD_STAT:1;    /**< \brief [28:28] Sub Command Status - SUB_CMD_STAT (r) */
    Ifx_UReg_32Bit IN_DORMANT_ST:1;    /**< \brief [29:29] In Dormant Status - IN_DORMANT_ST (r) */
    Ifx_UReg_32Bit LANE_SYNC:1;       /**< \brief [30:30] Lane Synchronization - LANE_SYNC (r) */
    Ifx_UReg_32Bit UHS2_IF_DETECT:1;    /**< \brief [31:31] UHS-II IF Detection - UHS2_IF_DETECT (r) */
} Ifx_SDMMC_PSTATE_REG_Bits;

/** \brief Power Control Register */
typedef struct _Ifx_SDMMC_PWR_CTRL_Bits
{
    Ifx_UReg_8Bit SD_BUS_PWR_VDD1:1;    /**< \brief [0:0] SD Bus Power for VDD1 - SD_BUS_PWR_VDD1 (rw) */
    Ifx_UReg_8Bit SD_BUS_VOL_VDD1:3;    /**< \brief [3:1] SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD. - SD_BUS_VOL_VDD1 (rw) */
    Ifx_UReg_8Bit SD_BUS_PWR_VDD2:1;    /**< \brief [4:4] SD Bus Power for VDD2. - SD_BUS_PWR_VDD2 (rw) */
    Ifx_UReg_8Bit SD_BUS_VOL_VDD2:3;    /**< \brief [7:5] SD Bus Voltage Select for VDD2. - SD_BUS_VOL_VDD2 (rw) */
} Ifx_SDMMC_PWR_CTRL_Bits;

/** \brief Pointer for Vendor Specific Area 2 */
typedef struct _Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits
{
    Ifx_UReg_16Bit REG_OFFSET_ADDR:12;    /**< \brief [11:0] Base offset Address for Command Queuing registers. - REG_OFFSET_ADDR (r) */
    Ifx_UReg_16Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
} Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits;

/** \brief Pointer for Vendor Specific Area 1 */
typedef struct _Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits
{
    Ifx_UReg_16Bit REG_OFFSET_ADDR:12;    /**< \brief [11:0] Base offset Address for Vendor Specific registers. - REG_OFFSET_ADDR (r) */
    Ifx_UReg_16Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
} Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits;

