HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSdmmc_regdef.h
/** \brief Block Size register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_BLOCKSIZE_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_BLOCKSIZE;

/** \brief eMMC Boot Control register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_BOOT_CTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_BOOT_CTRL;

/** \brief Buffer Data Port Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_BUF_DATA_Bits B;        /**< \brief Bitfield access */
} Ifx_SDMMC_BUF_DATA;

/** \brief Capabilities 1 Register 0 to 31   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CAPABILITIES1_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_CAPABILITIES1;

/** \brief Capabilities Register 32 to 63   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CAPABILITIES2_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_CAPABILITIES2;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CLC_Bits B;             /**< \brief Bitfield access */
} Ifx_SDMMC_CLC;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CLK_CTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_SDMMC_CLK_CTRL;

/** \brief Command register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CMD_Bits B;             /**< \brief Bitfield access */
} Ifx_SDMMC_CMD;

/** \brief Maximum Current Capabilities Register 0 to 31   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CURR_CAPABILITIES1_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_CURR_CAPABILITIES1;

/** \brief Maximum Current Capabilities Register 32 to 63   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_CURR_CAPABILITIES2_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_CURR_CAPABILITIES2;

/** \brief Embedded Control register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_EMBEDDED_CTRL_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_EMBEDDED_CTRL;

/** \brief eMMC Control register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_EMMC_CTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_EMMC_CTRL;

/** \brief Error Interrupt Signal Enable Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_ERROR_INT_SIGNAL_EN;

/** \brief Error Interrupt Status Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ERROR_INT_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_ERROR_INT_STAT;

/** \brief Error Interrupt Status Enable Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ERROR_INT_STAT_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_ERROR_INT_STAT_EN;

/** \brief Force Event Register for Auto CMD Error Status register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_FORCE_AUTO_CMD_STAT;

/** \brief Force Event Register for Error Interrupt Status   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_FORCE_ERROR_INT_STAT;

/** \brief Host Controller Version   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_HOST_CNTRL_VERS_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_HOST_CNTRL_VERS;

/** \brief Host Control 1 Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_HOST_CTRL1_Bits B;      /**< \brief Bitfield access */
} Ifx_SDMMC_HOST_CTRL1;

/** \brief Host Control 2 Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_HOST_CTRL2_Bits B;      /**< \brief Bitfield access */
} Ifx_SDMMC_HOST_CTRL2;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ID_Bits B;              /**< \brief Bitfield access */
} Ifx_SDMMC_ID;

